{
  "format": "graph-model",
  "modelName": "Wav2Lip Lip Synchronization",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج مزامنة حركة الشفاه مع الصوت - Wav2Lip",
  "modelTopology": {
    "node": [
      {
        "name": "face_image",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "96" },
                { "size": "96" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "audio_features",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "80" }, { "size": "16" }]
            }
          }
        }
      },
      {
        "name": "face_encoder",
        "op": "Conv2D",
        "input": ["face_image", "face_encoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "audio_encoder",
        "op": "Conv1D",
        "input": ["audio_features", "audio_encoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "lip_region_extractor",
        "op": "Conv2D",
        "input": ["face_encoder", "lip_extractor_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "audio_visual_fusion",
        "op": "Concat",
        "input": ["lip_region_extractor", "audio_encoder"],
        "attr": {
          "axis": { "i": -1 }
        }
      },
      {
        "name": "lip_generator",
        "op": "Conv2DTranspose",
        "input": ["audio_visual_fusion", "lip_generator_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "face_reconstructor",
        "op": "Conv2D",
        "input": ["lip_generator", "face_reconstructor_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "synced_face",
        "op": "Sigmoid",
        "input": ["face_reconstructor"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "face_encoder_weights",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "audio_encoder_weights",
          "shape": [5, 80, 256],
          "dtype": "float32"
        },
        {
          "name": "lip_extractor_weights",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "lip_generator_weights",
          "shape": [4, 4, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "face_reconstructor_weights",
          "shape": [3, 3, 32, 3],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "face_image": {
        "name": "face_image:0",
        "dtype": "DT_FLOAT"
      },
      "audio_features": {
        "name": "audio_features:0",
        "dtype": "DT_FLOAT"
      }
    },
    "outputs": {
      "synced_face": {
        "name": "synced_face:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "lip_sync_generation",
      "audio_visual_alignment",
      "facial_animation",
      "speech_driven_animation",
      "identity_preservation"
    ],
    "toolboxIntegration": {
      "singingFace": {
        "enabled": true,
        "musicSync": true,
        "realTimeSync": false,
        "highQuality": true
      },
      "aiAvatar": {
        "enabled": true,
        "voiceSync": true,
        "emotionPreservation": true,
        "naturalMovement": true
      }
    },
    "inputRequirements": {
      "faceImage": {
        "resolution": "96x96",
        "format": ["jpg", "png"],
        "faceDetection": "required",
        "frontFacing": "preferred"
      },
      "audioInput": {
        "sampleRate": 16000,
        "format": ["wav", "mp3"],
        "channels": "mono",
        "quality": "high"
      }
    },
    "outputQuality": {
      "lipSyncAccuracy": 0.93,
      "identityPreservation": 0.95,
      "naturalness": 0.88,
      "temporalConsistency": 0.91
    },
    "processingModes": {
      "standard": {
        "quality": "good",
        "speed": "fast",
        "memoryUsage": "medium"
      },
      "highQuality": {
        "quality": "excellent",
        "speed": "slow",
        "memoryUsage": "high"
      },
      "realTime": {
        "quality": "fair",
        "speed": "very_fast",
        "memoryUsage": "low"
      }
    },
    "features": {
      "lipMovements": {
        "visemes": ["A", "E", "I", "O", "U", "M", "B", "P", "F", "V"],
        "phoneticMapping": true,
        "languageAdaptive": true
      },
      "facialPreservation": {
        "identity": true,
        "expression": "partial",
        "lighting": true,
        "pose": "limited"
      },
      "temporalConsistency": {
        "frameCoherence": true,
        "smoothTransitions": true,
        "flickerReduction": true
      }
    },
    "limitations": {
      "extremePoses": "limited",
      "lowResolution": "degraded_quality",
      "backgroundNoise": "reduced_accuracy",
      "multiplefaces": "single_face_only"
    },
    "performance": {
      "processingSpeed": "1.5x real-time",
      "memoryUsage": "280MB",
      "accuracy": 0.93,
      "latency": "200ms per frame"
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "مزامنة حركة الشفاه",
      "en": "Lip Synchronization"
    },
    "benchmarkStats": {
      "loadTime": "2.1s",
      "averageProcessingTime": "1.5x duration",
      "memoryEfficiency": 0.81
    }
  }
}
