{
  "format": "graph-model",
  "modelName": "So-VITS Voice Conversion",
  "version": "4.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج تحويل الصوت المتقدم - So-VITS",
  "modelTopology": {
    "node": [
      {
        "name": "source_audio",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "80" }, { "size": "256" }]
            }
          }
        }
      },
      {
        "name": "target_speaker_id",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }]
            }
          }
        }
      },
      {
        "name": "content_encoder",
        "op": "Conv1D",
        "input": ["source_audio", "content_encoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "speaker_embedding",
        "op": "Gather",
        "input": ["speaker_embeddings", "target_speaker_id"]
      },
      {
        "name": "style_encoder",
        "op": "MatMul",
        "input": ["speaker_embedding", "style_weights"]
      },
      {
        "name": "decoder_input",
        "op": "Concat",
        "input": ["content_encoder", "style_encoder"],
        "attr": {
          "axis": { "i": -1 }
        }
      },
      {
        "name": "vocoder",
        "op": "Conv1DTranspose",
        "input": ["decoder_input", "vocoder_weights"],
        "attr": {
          "strides": { "list": { "i": [8] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "converted_audio",
        "op": "Tanh",
        "input": ["vocoder"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "content_encoder_weights",
          "shape": [5, 80, 256],
          "dtype": "float32"
        },
        {
          "name": "speaker_embeddings",
          "shape": [256, 256],
          "dtype": "float32"
        },
        {
          "name": "style_weights",
          "shape": [256, 256],
          "dtype": "float32"
        },
        {
          "name": "vocoder_weights",
          "shape": [16, 1, 512],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "source_audio": {
        "name": "source_audio:0",
        "dtype": "DT_FLOAT"
      },
      "target_speaker_id": {
        "name": "target_speaker_id:0",
        "dtype": "DT_INT32"
      }
    },
    "outputs": {
      "converted_audio": {
        "name": "converted_audio:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "voice_conversion",
      "speaker_transfer",
      "pitch_modification",
      "timbre_control",
      "emotion_transfer"
    ],
    "toolboxIntegration": {
      "voiceChange": {
        "enabled": true,
        "realtimeProcessing": false,
        "multiSpeakerSupport": true,
        "emotionControl": true
      },
      "audioProcessor": {
        "enabled": true,
        "pitchShift": true,
        "formantShift": true,
        "speedControl": true
      }
    },
    "voiceProfiles": {
      "male_adult": {
        "id": 0,
        "description": "Adult male voice",
        "pitch": "low",
        "characteristics": ["deep", "authoritative"]
      },
      "female_adult": {
        "id": 1,
        "description": "Adult female voice",
        "pitch": "medium",
        "characteristics": ["clear", "professional"]
      },
      "young_male": {
        "id": 2,
        "description": "Young male voice",
        "pitch": "medium-high",
        "characteristics": ["energetic", "friendly"]
      },
      "young_female": {
        "id": 3,
        "description": "Young female voice",
        "pitch": "high",
        "characteristics": ["bright", "cheerful"]
      },
      "elder_male": {
        "id": 4,
        "description": "Elderly male voice",
        "pitch": "low-medium",
        "characteristics": ["wise", "experienced"]
      },
      "elder_female": {
        "id": 5,
        "description": "Elderly female voice",
        "pitch": "medium",
        "characteristics": ["warm", "caring"]
      }
    },
    "conversionModes": {
      "voice_only": {
        "description": "Convert voice timbre only",
        "preserves": ["content", "emotion", "speed"]
      },
      "full_conversion": {
        "description": "Complete voice transformation",
        "preserves": ["content"],
        "modifies": ["timbre", "pitch", "style"]
      },
      "emotion_transfer": {
        "description": "Transfer emotional expression",
        "preserves": ["content", "timbre"],
        "modifies": ["emotion", "intonation"]
      }
    },
    "qualitySettings": {
      "fast": {
        "processingTime": "0.5x real-time",
        "quality": "good",
        "latency": "200ms"
      },
      "balanced": {
        "processingTime": "1x real-time",
        "quality": "high",
        "latency": "500ms"
      },
      "studio": {
        "processingTime": "2x real-time",
        "quality": "excellent",
        "latency": "1s"
      }
    },
    "audioFormats": {
      "input": ["wav", "mp3", "flac"],
      "output": ["wav", "mp3"],
      "sampleRate": [22050, 44100, 48000],
      "bitDepth": [16, 24]
    },
    "performance": {
      "conversionSpeed": "1-2x real-time",
      "memoryUsage": "220MB",
      "similarity": 0.88,
      "naturalness": 0.91
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "تحويل وتغيير الصوت",
      "en": "Voice Conversion & Change"
    },
    "benchmarkStats": {
      "loadTime": "2.5s",
      "averageConversionTime": "1.5x duration",
      "memoryEfficiency": 0.84
    }
  }
}
