{
  "format": "graph-model",
  "modelName": "AnimateDiff Motion Generation",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج إنشاء الحركة والرسوم المتحركة - AnimateDiff",
  "modelTopology": {
    "node": [
      {
        "name": "base_image",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "512" },
                { "size": "512" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "motion_prompt",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "77" }]
            }
          }
        }
      },
      {
        "name": "motion_encoder",
        "op": "Gather",
        "input": ["motion_embeddings", "motion_prompt"]
      },
      {
        "name": "temporal_layers",
        "op": "Conv3D",
        "input": ["base_image", "temporal_conv_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "motion_conditioning",
        "op": "MatMul",
        "input": ["temporal_layers", "motion_encoder"]
      },
      {
        "name": "animation_decoder",
        "op": "Conv3DTranspose",
        "input": ["motion_conditioning", "decoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "frame_sequence",
        "op": "Sigmoid",
        "input": ["animation_decoder"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "motion_embeddings",
          "shape": [49408, 768],
          "dtype": "float32"
        },
        {
          "name": "temporal_conv_weights",
          "shape": [3, 3, 3, 3, 256],
          "dtype": "float32"
        },
        {
          "name": "decoder_weights",
          "shape": [3, 3, 3, 3, 256],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "base_image": {
        "name": "base_image:0",
        "dtype": "DT_FLOAT"
      },
      "motion_prompt": {
        "name": "motion_prompt:0",
        "dtype": "DT_INT32"
      }
    },
    "outputs": {
      "frame_sequence": {
        "name": "frame_sequence:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "image_to_video_animation",
      "motion_generation",
      "temporal_consistency",
      "style_preservation",
      "controllable_movement"
    ],
    "toolboxIntegration": {
      "aiAnimation": {
        "enabled": true,
        "motionTypes": ["zoom", "pan", "rotate", "fade", "morph"],
        "durationControl": [1, 10],
        "loopGeneration": true
      },
      "aiEffects": {
        "enabled": true,
        "particleEffects": true,
        "atmosphericEffects": true,
        "lightingAnimation": true
      }
    },
    "templateSupport": {
      "birthday": {
        "celebrationEffects": true,
        "confettiAnimation": true,
        "sparkleEffects": true
      },
      "festival": {
        "culturalAnimations": true,
        "seasonalEffects": true,
        "traditionalMotions": true
      },
      "intro": {
        "logoAnimations": true,
        "textAnimations": true,
        "brandReveal": true
      },
      "outro": {
        "closingAnimations": true,
        "creditRolls": true,
        "fadeOutEffects": true
      }
    },
    "motionPresets": {
      "gentle": {
        "speed": "slow",
        "smoothness": "high",
        "intensity": "subtle"
      },
      "dynamic": {
        "speed": "medium",
        "smoothness": "medium",
        "intensity": "moderate"
      },
      "dramatic": {
        "speed": "fast",
        "smoothness": "low",
        "intensity": "strong"
      }
    },
    "outputSettings": {
      "frameCount": [8, 16, 24, 32],
      "frameRate": [8, 12, 24, 30],
      "resolution": ["512x512", "768x768", "1024x1024"],
      "format": ["mp4", "gif", "webm"]
    },
    "performance": {
      "generationTime": "20-45s per 16 frames",
      "memoryUsage": "2.8GB",
      "quality": "high",
      "temporalConsistency": 0.94
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "إنشاء الحركة والرسوم المتحركة",
      "en": "Motion and Animation Generation"
    },
    "benchmarkStats": {
      "loadTime": "4.5s",
      "averageGenerationTime": "30s",
      "memoryEfficiency": 0.81
    }
  }
}
