{
  "format": "graph-model",
  "modelName": "VideoCrafter Local Video Generation",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج توليد الفيديو المحلي - VideoCrafter",
  "modelTopology": {
    "node": [
      {
        "name": "text_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "77" }]
            }
          }
        }
      },
      {
        "name": "noise_input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "8" },
                { "size": "64" },
                { "size": "64" },
                { "size": "16" }
              ]
            }
          }
        }
      },
      {
        "name": "text_encoder",
        "op": "Gather",
        "input": ["text_embeddings", "text_input"]
      },
      {
        "name": "temporal_unet",
        "op": "Conv3D",
        "input": ["noise_input", "temporal_conv_kernel"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "cross_attention_3d",
        "op": "MatMul",
        "input": ["temporal_unet", "text_encoder"]
      },
      {
        "name": "temporal_decoder",
        "op": "Conv3DTranspose",
        "input": ["cross_attention_3d", "decoder_kernel"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "video_output",
        "op": "Sigmoid",
        "input": ["temporal_decoder"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "text_embeddings",
          "shape": [49408, 768],
          "dtype": "float32"
        },
        {
          "name": "temporal_conv_kernel",
          "shape": [3, 3, 3, 8, 256],
          "dtype": "float32"
        },
        {
          "name": "decoder_kernel",
          "shape": [4, 4, 4, 3, 256],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "text_input": {
        "name": "text_input:0",
        "dtype": "DT_INT32"
      },
      "noise_input": {
        "name": "noise_input:0",
        "dtype": "DT_FLOAT"
      }
    },
    "outputs": {
      "video_output": {
        "name": "video_output:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "text_to_video",
      "video_animation",
      "temporal_consistency",
      "motion_generation",
      "scene_composition"
    ],
    "toolboxIntegration": {
      "textToVideo": {
        "enabled": true,
        "maxLength": "16 frames",
        "resolution": ["512x512", "768x768"],
        "frameRate": [8, 12, 24]
      },
      "aiVideoGenerator": {
        "enabled": true,
        "promptLength": 77,
        "styleSupport": true,
        "motionControl": true
      },
      "aiAnimation": {
        "enabled": true,
        "animationTypes": [
          "smooth_transition",
          "object_motion",
          "camera_movement"
        ],
        "durationRange": [2, 30]
      }
    },
    "templateSupport": {
      "intro": {
        "logoAnimation": true,
        "brandIntegration": true,
        "transitionEffects": true
      },
      "outro": {
        "endScreenGeneration": true,
        "callToActionAnimations": true,
        "brandingElements": true
      }
    },
    "outputFormats": ["mp4", "webm", "gif"],
    "performance": {
      "generationTime": "30-60s per 16 frames",
      "memoryUsage": "4.2GB",
      "quality": "high",
      "temporalConsistency": 0.91
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "توليد الفيديو من النص",
      "en": "Text to Video Generation"
    },
    "benchmarkStats": {
      "loadTime": "6.8s",
      "averageGenerationTime": "45s",
      "memoryEfficiency": 0.74
    }
  }
}
