{
  "format": "graph-model",
  "modelName": "SceneCut AI Transition",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج كشف المشاهد والانتقالات الذكية",
  "modelTopology": {
    "node": [
      {
        "name": "frame_sequence",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "10" },
                { "size": "224" },
                { "size": "224" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "spatial_features",
        "op": "Conv3D",
        "input": ["frame_sequence", "spatial_conv_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 1, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "temporal_features",
        "op": "Conv3D",
        "input": ["spatial_features", "temporal_conv_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 1, 1, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "scene_embedding",
        "op": "GlobalAveragePooling3D",
        "input": ["temporal_features"]
      },
      {
        "name": "similarity_matrix",
        "op": "MatMul",
        "input": ["scene_embedding", "scene_embedding"],
        "attr": {
          "transpose_b": { "b": true }
        }
      },
      {
        "name": "scene_boundaries",
        "op": "Conv1D",
        "input": ["scene_embedding", "boundary_conv_weights"],
        "attr": {
          "strides": { "list": { "i": [1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "transition_type",
        "op": "Dense",
        "input": ["scene_embedding", "transition_dense_weights"]
      },
      {
        "name": "cut_probability",
        "op": "Sigmoid",
        "input": ["scene_boundaries"]
      },
      {
        "name": "transition_style",
        "op": "Softmax",
        "input": ["transition_type"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "spatial_conv_weights",
          "shape": [3, 3, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "temporal_conv_weights",
          "shape": [3, 3, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "boundary_conv_weights",
          "shape": [5, 128, 1],
          "dtype": "float32"
        },
        {
          "name": "transition_dense_weights",
          "shape": [128, 8],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "frame_sequence": {
        "name": "frame_sequence:0",
        "dtype": "DT_FLOAT"
      }
    },
    "outputs": {
      "cut_probability": {
        "name": "cut_probability:0",
        "dtype": "DT_FLOAT"
      },
      "transition_style": {
        "name": "transition_style:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "scene_change_detection",
      "transition_generation",
      "content_based_cuts",
      "intelligent_editing",
      "style_matching"
    ],
    "toolboxIntegration": {
      "aiTransition": {
        "enabled": true,
        "automaticCuts": true,
        "styleMatching": true,
        "contentAware": true
      },
      "videoEditor": {
        "enabled": true,
        "smartCuts": true,
        "batchProcessing": true,
        "previewMode": true
      }
    },
    "transitionTypes": {
      "cut": {
        "description": "Direct scene cut",
        "duration": 0,
        "complexity": "low"
      },
      "fade": {
        "description": "Fade in/out transition",
        "duration": "0.5-2s",
        "complexity": "low"
      },
      "dissolve": {
        "description": "Cross-dissolve between scenes",
        "duration": "1-3s",
        "complexity": "medium"
      },
      "wipe": {
        "description": "Directional wipe transition",
        "duration": "0.5-1.5s",
        "complexity": "medium"
      },
      "slide": {
        "description": "Sliding transition",
        "duration": "0.8-2s",
        "complexity": "medium"
      },
      "zoom": {
        "description": "Zoom-based transition",
        "duration": "1-2.5s",
        "complexity": "high"
      },
      "morph": {
        "description": "Morphing transition",
        "duration": "1.5-3s",
        "complexity": "high"
      },
      "particle": {
        "description": "Particle effect transition",
        "duration": "2-4s",
        "complexity": "very_high"
      }
    },
    "sceneAnalysis": {
      "contentTypes": [
        "talking_head",
        "landscape",
        "action",
        "close_up",
        "wide_shot",
        "indoor",
        "outdoor",
        "night",
        "day",
        "movement",
        "static"
      ],
      "visualFeatures": [
        "color_histogram",
        "edge_density",
        "motion_vectors",
        "brightness",
        "contrast",
        "saturation",
        "texture"
      ],
      "temporalFeatures": [
        "motion_intensity",
        "camera_movement",
        "object_tracking",
        "scene_activity",
        "cut_frequency"
      ]
    },
    "intelligentCuts": {
      "rules": {
        "motion_based": "Cut during high motion for smooth transition",
        "audio_sync": "Sync cuts with audio beats or pauses",
        "content_aware": "Match transition style to content type",
        "duration_adaptive": "Adjust transition length based on scene"
      },
      "thresholds": {
        "scene_change": 0.7,
        "motion_threshold": 0.3,
        "similarity_threshold": 0.85
      }
    },
    "customization": {
      "userPreferences": {
        "transition_speed": ["slow", "medium", "fast"],
        "style_preference": ["subtle", "dramatic", "artistic"],
        "complexity": ["simple", "moderate", "advanced"]
      },
      "projectTypes": {
        "music_video": {
          "beat_sync": true,
          "rapid_cuts": true,
          "creative_transitions": true
        },
        "documentary": {
          "natural_cuts": true,
          "minimal_effects": true,
          "content_flow": true
        },
        "commercial": {
          "impact_transitions": true,
          "brand_consistency": true,
          "attention_grabbing": true
        }
      }
    },
    "performance": {
      "analysisSpeed": "2x real-time",
      "memoryUsage": "50MB",
      "accuracy": 0.88,
      "processingLatency": "500ms"
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "الانتقالات الذكية بين المشاهد",
      "en": "Smart Scene Transitions"
    },
    "benchmarkStats": {
      "loadTime": "1.2s",
      "averageAnalysisTime": "0.5x duration",
      "memoryEfficiency": 0.92
    }
  }
}
