{
  "format": "graph-model",
  "modelName": "SadTalker Talking Avatar",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج الصور المتحدثة والأفاتار - SadTalker",
  "modelTopology": {
    "node": [
      {
        "name": "face_image",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "-1" },
                { "size": "512" },
                { "size": "512" },
                { "size": "3" }
              ]
            }
          }
        }
      },
      {
        "name": "audio_features",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "80" }, { "size": "16" }]
            }
          }
        }
      },
      {
        "name": "face_encoder",
        "op": "Conv2D",
        "input": ["face_image", "face_encoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "audio_encoder",
        "op": "Conv1D",
        "input": ["audio_features", "audio_encoder_weights"],
        "attr": {
          "strides": { "list": { "i": [1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "expression_decoder",
        "op": "MatMul",
        "input": ["audio_encoder", "expression_weights"]
      },
      {
        "name": "pose_decoder",
        "op": "MatMul",
        "input": ["audio_encoder", "pose_weights"]
      },
      {
        "name": "animation_generator",
        "op": "Conv2DTranspose",
        "input": ["face_encoder", "animation_weights"],
        "attr": {
          "strides": { "list": { "i": [1, 2, 2, 1] } },
          "padding": { "s": "SAME" }
        }
      },
      {
        "name": "talking_video",
        "op": "Sigmoid",
        "input": ["animation_generator"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "face_encoder_weights",
          "shape": [3, 3, 3, 64],
          "dtype": "float32"
        },
        {
          "name": "audio_encoder_weights",
          "shape": [5, 80, 256],
          "dtype": "float32"
        },
        {
          "name": "expression_weights",
          "shape": [256, 70],
          "dtype": "float32"
        },
        {
          "name": "pose_weights",
          "shape": [256, 6],
          "dtype": "float32"
        },
        {
          "name": "animation_weights",
          "shape": [4, 4, 3, 64],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "face_image": {
        "name": "face_image:0",
        "dtype": "DT_FLOAT"
      },
      "audio_features": {
        "name": "audio_features:0",
        "dtype": "DT_FLOAT"
      }
    },
    "outputs": {
      "talking_video": {
        "name": "talking_video:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "talking_avatar_generation",
      "audio_driven_animation",
      "facial_expression_synthesis",
      "lip_sync_generation",
      "head_pose_control"
    ],
    "toolboxIntegration": {
      "aiAvatar": {
        "enabled": true,
        "photoToVideo": true,
        "audioSync": true,
        "expressionControl": true
      },
      "singingFace": {
        "enabled": true,
        "musicSync": true,
        "emotionalExpression": true,
        "rhythmFollowing": true
      }
    },
    "inputSupport": {
      "faceImage": {
        "formats": ["jpg", "png", "webp"],
        "resolution": ["512x512", "1024x1024"],
        "faceDetection": "automatic"
      },
      "audioInput": {
        "formats": ["wav", "mp3", "aac"],
        "sampleRate": [16000, 22050, 44100],
        "channels": ["mono", "stereo"]
      }
    },
    "animationModes": {
      "natural": {
        "expressionIntensity": "subtle",
        "movementStyle": "realistic",
        "blinkingRate": "normal"
      },
      "expressive": {
        "expressionIntensity": "enhanced",
        "movementStyle": "animated",
        "blinkingRate": "dynamic"
      },
      "presentation": {
        "expressionIntensity": "professional",
        "movementStyle": "controlled",
        "blinkingRate": "minimal"
      }
    },
    "qualitySettings": {
      "preview": {
        "resolution": "256x256",
        "fps": 15,
        "quality": "fast"
      },
      "standard": {
        "resolution": "512x512",
        "fps": 25,
        "quality": "balanced"
      },
      "studio": {
        "resolution": "1024x1024",
        "fps": 30,
        "quality": "high"
      }
    },
    "features": {
      "lipSync": {
        "accuracy": 0.94,
        "naturalness": 0.89,
        "multiLanguage": true
      },
      "headPose": {
        "rangeX": [-30, 30],
        "rangeY": [-20, 20],
        "rangeZ": [-15, 15]
      },
      "expressions": {
        "emotions": ["neutral", "happy", "sad", "surprised", "angry"],
        "intensity": [0.1, 1.0],
        "blending": true
      }
    },
    "performance": {
      "generationTime": "2-5s per second of video",
      "memoryUsage": "580MB",
      "quality": "high",
      "lipSyncAccuracy": 0.94
    },
    "loadOnDemand": true,
    "quantizationSupport": true,
    "metadataLocalization": {
      "ar": "الصور المتحدثة والأفاتار",
      "en": "Talking Avatar Generation"
    },
    "benchmarkStats": {
      "loadTime": "3.8s",
      "averageGenerationTime": "3s per second",
      "memoryEfficiency": 0.76
    }
  }
}
