{
  "format": "graph-model",
  "modelName": "GPT4All Local Text Generation",
  "version": "1.0.0",
  "generatedBy": "KNOUX AI Team",
  "convertedBy": "TensorFlow.js Converter",
  "description": "نموذج توليد النصوص المحلي بديل GPT4All",
  "modelTopology": {
    "node": [
      {
        "name": "input_ids",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "512" }]
            }
          }
        }
      },
      {
        "name": "embedding",
        "op": "Gather",
        "input": ["embedding/weight", "input_ids"],
        "attr": {
          "validate_indices": { "b": true }
        }
      },
      {
        "name": "transformer_layer_1",
        "op": "MatMul",
        "input": ["embedding", "transformer_1/weight"]
      },
      {
        "name": "transformer_attention_1",
        "op": "Softmax",
        "input": ["transformer_layer_1"]
      },
      {
        "name": "transformer_layer_2",
        "op": "MatMul",
        "input": ["transformer_attention_1", "transformer_2/weight"]
      },
      {
        "name": "output_projection",
        "op": "MatMul",
        "input": ["transformer_layer_2", "output/weight"]
      },
      {
        "name": "output_logits",
        "op": "Softmax",
        "input": ["output_projection"]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "embedding/weight",
          "shape": [50000, 768],
          "dtype": "float32"
        },
        {
          "name": "transformer_1/weight",
          "shape": [768, 768],
          "dtype": "float32"
        },
        {
          "name": "transformer_2/weight",
          "shape": [768, 768],
          "dtype": "float32"
        },
        {
          "name": "output/weight",
          "shape": [768, 50000],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "input_ids": {
        "name": "input_ids:0",
        "dtype": "DT_INT32"
      }
    },
    "outputs": {
      "output_logits": {
        "name": "output_logits:0",
        "dtype": "DT_FLOAT"
      }
    }
  },
  "userDefinedMetadata": {
    "capabilities": [
      "text_generation",
      "copywriting",
      "summarization",
      "translation",
      "question_answering"
    ],
    "languages": ["ar", "en"],
    "maxTokens": 512,
    "temperature": 0.7,
    "performance": {
      "speed": "fast",
      "memoryUsage": "120MB",
      "accuracy": 0.89
    }
  }
}
